mathe/grapheninduktion.html
---
layout: page
title: Grapheninduktion
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Grapheninduktion</h2>
<div class="outline-text-2" id="text-1">
<p>
TODO: Prinzip
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Aufbau eines Induktionsbeweis</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Beh:</b> Für alle gerichteten Graphen \(G=(V,E)\) gilt: ⟨Aussage⟩
</p>

<p>
<b>Beweis (durch strukturelle Induktion):</b>
</p>

<p>
<b>IB <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>:</b> Sei \(G\) ein gerichteter Graph mit einem Knoten. Dann gilt
⟨Beweis⟩
</p>

<p>
<b>IV <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>:</b> Sei \(n \in \mathbb{N}\) so gegeben, dass für alle gerichteten
Graph \(G=(V,E)\) mit \(m \leq n\) Knoten gilt: ⟨Aussage⟩.
</p>

<p>
<b>IS <sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>:</b> Sei \(G=(V,E)\) ein gerichteter Graph mit \(n+1\) Knoten. Wir
zeigen, dass ⟨Aussage⟩ für \(G\) gilt. ⟨Beweis⟩
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
IB = <i>Induktionsbeginn</i>
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
IV = <i>Induktionsvoraussetzung</i> (oder auch <i>Induktionshyptohese</i>)
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
IS = <i>Induktionsschluss</i>
</p></div>


</div>
</div>
